Load the dataset
Load the transaction data with Pandas and display the first few rows to confirm it loaded correctly.

In [1]:
import pandas as pd

df = pd.read_csv("retail_transactions.csv")
df.head()

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,RETAIL_DISC,TRANS_TIME,WEEK_NO,COUPON_DISC,COUPON_MATCH_DISC
0,2375,26984851472,1,1004906,1,1.39,364,-0.60,1631,1,0.0,0.0
1,2375,26984851472,1,1033142,1,0.82,364,0.00,1631,1,0.0,0.0
2,2375,26984851472,1,1036325,1,0.99,364,-0.30,1631,1,0.0,0.0
3,2375,26984851472,1,1082185,1,1.21,364,0.00,1631,1,0.0,0.0
4,2375,26984851472,1,8160430,1,1.50,364,-0.39,1631,1,0.0,0.0

Select key columns
Focus on `household_key` (customer ID) and `SALES_VALUE` (dollar amount) to understand basic customer spending.

ilter high-value transactions
Show transactions where `SALES_VALUE` is greater than 100 to identify unusually large purchases.

Sort by purchase amount
Sort the data by `SALES_VALUE` in descending order to view the highest-value item purchases.

In [2]:
df[["household_key", "SALES_VALUE"]].head()
df[df["SALES_VALUE"] > 100]
df.sort_values("SALES_VALUE", ascending=False).head()

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,RETAIL_DISC,TRANS_TIME,WEEK_NO,COUPON_DISC,COUPON_MATCH_DISC
1085442,1609,32006114302,339,12484608,3,840.00,412,0.0,2038,49,0.0,0.0
2030766,346,40387571385,574,948670,5,631.80,415,0.0,1312,83,0.0,0.0
655985,125,30515165970,230,1089093,2,505.00,323,0.0,1231,34,0.0,0.0
1152895,374,32187143334,355,13212959,1,499.99,361,-50.0,1740,51,0.0,0.0
547657,125,30031850855,201,1089093,1,455.00,323,0.0,1059,29,0.0,0.0

Total revenue per customer
Group by `household_key` and sum `SALES_VALUE` to see how much each household spent overall.

In [3]:
df.groupby("household_key")["SALES_VALUE"].sum().head()

household_key
1    4330.16
2    1954.34
3    2653.21
4    1200.11
5     779.06
Name: SALES_VALUE, dtype: float64

Weekly revenue trends
Group by `WEEK_NO` to analyze how total sales change across different weeks.

In [4]:
df.groupby("WEEK_NO")["SALES_VALUE"].sum().head()

WEEK_NO
1     5211.16
2    10821.35
3    13498.20
4    15965.99
5    20139.82
Name: SALES_VALUE, dtype: float64

RFM prep summary
Create a simple RFM-style table using:
- Recency: last day the customer appeared  
- Frequency: number of unique baskets  
- Monetary: total spend  
This will be used later for RFM scoring and clustering.

In [5]:
customer_summary = df.groupby("household_key").agg({
    "SALES_VALUE": "sum",
    "BASKET_ID": "nunique"
}).rename(columns={
    "SALES_VALUE": "total_spent",
    "BASKET_ID": "num_baskets"
})

customer_summary.head()

               total_spent  num_baskets
household_key
1                  4330.16           86
2                  1954.34           45
3                  2653.21           47
4                  1200.11           30
5                   779.06           40